app/views/users/index.json.jbuilder

json.users @users.each do |user|
---
SELECT `users`.* FROM `users`