app/controllers/home_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`mobile` = '8817819965' LIMIT 1
---
  def login
    #command = AuthenticateUser.call(params[:mobile], params[:password])
    user = User.find_by_mobile(params[:mobile])

INSERT INTO `suggestions` (`name`, `email`, `mobile`, `user_id`, `created_at`, `updated_at`) VALUES ('ramesh', 'sujeet@freightclue.com', '8817819965', 1, '2019-11-06 05:42:45', '2019-11-06 05:42:45')
---
    def create_survey
        @survey = Suggestion.new(survey_params)
        @survey.user_id = current_user.id
        if @survey.save