app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `suggestions` WHERE `suggestions`.`user_id` = 1
---
  def show
    @user = User.find(params[:id])
    @survey=Suggestion.where(user_id:@user.id).count